package lesson1;

/*
10. Напишите программу с тремя переменными целого типа, первым двум присвойте значения,
а третьей переменной присвойте их сумму. Выведете значение третей переменной на экран.
 */

public class Task10 {
    public static void main(String[] args) {
        int a = 21;
        int b = 2;
        int c = a + b;
        System.out.println("Значение третьей переменной - " + c);
    }
}
